saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.LPC54616_DFP.11.0.0.pdsc
      <device Dname="LPC54616J256">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="180000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/LPC54616J256_flash.icf"/>
        </environment>
        <sequences>
          <sequence name="ResetCatchSet">
            <block>
      Sequence("ResetCatchSet_LPC5460x_M4");
    </block>
          </sequence>
          <sequence name="TraceStart">
            <block>
      Sequence("TraceStart_CM4");
    </block>
          </sequence>
        </sequences>
        <memory name="EEPROM" start="0x40108000" size="0x4000" access="rx"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAMX" start="0x04000000" size="0x8000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x018000" access="rw" default="1"/>
        <memory name="USB_RAM" start="0x40100000" size="0x2000" access="rw"/>
        <algorithm name="arm/LPC5460x_256.FLM" start="0x00000000" size="0x00040000" RAMstart="0x04000000" RAMsize="0x00008000" default="1"/>
        <debug svd="LPC54616.xml"/>
        <variant Dvariant="LPC54616J256ET180">
          <compile header="fsl_device_registers.h" define="CPU_LPC54616J256ET180"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54616J256ET180/LPC54616J256_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common_AND_driver.power">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54616_AND_utility.debug_console">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54616_AND_component.lists_AND_utility.debug_console">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.flexcomm_usart">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54616">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.LPC54616_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common_AND_driver.dmic">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.dmic_AND_driver.lpc_dma">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common_AND_driver.inputmux_connections">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.lpc_dma_AND_driver.spifi">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spifi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.flexcomm_AND_driver.flexcomm_spi_AND_driver.lpc_dma">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common_AND_driver.flexcomm">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.flexcomm_i2s_AND_driver.lpc_dma">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_i2c_AND_driver.lpc_dma">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54616_AND_driver.flexcomm">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
    </condition>
    <condition id="device.LPC54616_AND_device.LPC54616_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54616_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC54616_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC54616_startup_AND_driver.clock_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54616_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="device.LPC54616_AND_CMSIS_Include_core_cm4">
      <accept Dname="LPC54616J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54616J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
